# Parameter Type Id Wall Sweep Placement Horizontal Property

Source: https://www.revitapidocs.com/2026/a9298e8a-9a9d-f24a-1dde-15a42db8957f.htm

---

| Parameter Type Id Wall Sweep Placement Horizontal Property |
| --- |

"Horizontal"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId WallSweepPlacementHorizontal { get; }
```

```
Public Shared ReadOnly Property WallSweepPlacementHorizontal As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ WallSweepPlacementHorizontal {
	ForgeTypeId^ get ();
}
```

```
static member WallSweepPlacementHorizontal : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace